'''
Даны два неупорядоченных набора целых чисел (может быть, с
повторениями). Выдать без повторений в порядке возрастания все те числа, которые
встречаются в обоих наборах.
Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
элементов второго множества. Затем пользователь вводит сами элементы множеств.

11 6 12
2 4 6 8 10 12 10 8 6 4 2 3 6 9 12 15 18

6 12
'''

# n=int(input('Введите кол-во элементов первого набора: '))
# m=int(input('Введите кол-во элементов первого набора: '))
# s1=set()
# s2=set()

# print('Первый набор')
# for i in range(n):
#     s1.add(int(input('Введите число: ')))

# print('Второй набор')
# for i in range(m):
#     s2.add(int(input('Введите число: ')))

# print(sorted(s1.intersection(s2)))

'''
 В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
круглой грядке, причем кусты высажены только по окружности. Таким образом, у
каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
выросло различное число ягод – на i-ом кусте выросло ai
 ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники.
Эта система состоит из управляющего модуля и нескольких собирающих модулей.
Собирающий модуль за один заход, находясь непосредственно перед некоторым
кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может
собрать за один заход собирающий модуль, находясь перед некоторым кустом
заданной во входном файле грядки.

4 -> 1 2 3 4
9
'''

# n=int(input('Введите число кустов: '))
# my_list=[]
# for i in range(n):
#     my_list.append(int(input(f'Введите число ягод куста {i+1}: ')))
# print(my_list)

# max=my_list[0]
# for i in range(n):
#     if i==n-1:
#         x=my_list[i]+my_list[0]+my_list[i-1]
#     else:
#         x=my_list[i]+my_list[i+1]+my_list[i-1]
#     if x>max:
#         max=x
# print(max)