'''
Заполните массив элементами арифметической
прогрессии. Её первый элемент, разность и количество
элементов нужно ввести с клавиатуры. Формула для
получения n-го члена прогрессии: an= a1 + (n-1) * d.
Каждое число вводится с новой строки.
'''

# n=int(input('Введите начальное значение: '))
# k=int(input('Введите разность: '))
# m=int(input('Введите кол-во элементов: '))

# res=[]
# for i in range(m):
#     res.append(n+i*k)
# print(res)

'''
Определить индексы элементов массива (списка),
значения которых принадлежат заданному диапазону (т.е. не
меньше заданного минимума и не больше заданного
максимума)
'''

# my_list=[-5, 9, 0, 3, -1, -2, 1,4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

# min=int(input('Введите минимум: '))
# max=int(input('Введите максимум: '))

# res=[]

# for i in range(len(my_list)):
#     if min<my_list[i]<max:
#         res.append(i)

# print(res)