# задача 1
"""
n=int(input('Введите расстояние за день:'))
m=int(input('Введите общее растсояние:'))

print((n+m-1)//n)
"""


# задача 3
""" 
a=int(input('Кол-во учеников в первом классе:'))
b=int(input('Кол-во учеников во втором классе:'))
c=int(input('Кол-во учеников в третьем классе:'))

print((a+1)//2+ (b+1)//2 + (c+1)//2)
"""

# задача 5
"""
a=int(input('Номер вагона от головы состава: '))
b=int(input('Номер вагона: '))

if a!=b:
    print('Всего вагонов',a+b-1)
else:
    print('Необходима доп. информация')
"""

# задача 7
""" 
a=int(input('Введите год:'))
if a%4==0 and a%100!=0 or a%400==0:
    print('Високосный')
else:
    print('Не високосный')
"""